---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSTLImportLinkAvailable
source: html/5696f417-fc6c-2dc1-d5eb-d962844210bf.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSTLImportLinkAvailable Method

Checks whether the STL Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsSTLImportLinkAvailable()
```

## Returns
True if the STL Import/Link functionality is available in the installed Revit.

## Remarks
STL Import/Link is optional functionality that does not have to be a part of the Revit installation.